---
kind: property
id: P:Autodesk.Revit.DB.Workset.IsVisibleByDefault
zh: 工作集
source: html/1b8afc56-1985-8459-0626-3fa73114c4c3.htm
---
# Autodesk.Revit.DB.Workset.IsVisibleByDefault Property

**中文**: 工作集

Whether the workset is visible by default.

## Syntax (C#)
```csharp
public bool IsVisibleByDefault { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - WorksetDefaultVisibilitySettings is not applicable to family documents.